# -*-mode:ruby-*- vim:ft=ruby

# ~/.Brewfile
# =============================================================================
# Bundler for non-Ruby dependencies from Homebrew, Homebrew Cask and the Mac
# App Store.
#
# Reference: https://github.com/Homebrew/homebrew-bundle
#
# Quick Start: brew bundle --global
#

# 'brew install'
brew "goland"
brew "base64"
brew "cmake"
brew "coreutils"
brew "curl"
brew "findutils"
brew "gcc"
brew "gdbm"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "gnu-sed"
brew "gnutls"
brew "htop"
brew "make"
brew "mas"
brew "neovim"
brew "pinentry-mac"
brew "readline"
brew "sipcalc"
brew "watch"
brew "wget"
brew "jq"
brew "yq"
brew "eza"
brew "tmux"
brew "azure-cli"
brew "awscli"
brew "kubelogin"
brew "podman"
brew "pinentry"
brew "pinentry-mac"
brew "opentofu"
brew "gh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "claude-code"
cask "windsurf"
cask "visual-studio-code"
cask "rectangle"
cask "font-fira-code-nerd-font"
cask "displaylink"
cask "iterm2"
cask "postman"
cask "google-chrome"

{{- if not .headless }}
# 'brew install --cask'
cask "font-hack-nerd-font"
{{- end }}
